; domain
(define (domain grid)
(:requirements :strips :constraints)
(:predicates (pred_2 ?v12 ?v7)
             (pred_1 ?v3 ?v2)
             (pred_9 ?v12 ?v2)
             (pred_11 ?v9 ?v12 )
	     (pred_8 ?v12)
             (pred_3 ?v1)
             (pred_4 ?v3)
             (pred_12 ?v2)
             (pred_5 ?v12)
             (pred_7 ?v3)
             (pred_6 ?v12)
             (pred_10 ))



(:action op_1
:parameters (?v8 ?v4 ?v13 ?v11)
:precondition (and (pred_3 ?v8) (pred_3 ?v4) (pred_4 ?v13) (pred_12 ?v11)
          (pred_2 ?v8 ?v4) (pred_1 ?v13 ?v11)
                   (pred_9 ?v4 ?v11) (pred_8 ?v8) 
                   (pred_5 ?v4) (pred_7 ?v13))
:effect (and  (pred_6 ?v4) (not (pred_5 ?v4))))


(:action op_5
:parameters (?v8 ?v5)
:precondition (and (pred_3 ?v8) (pred_3 ?v5)
               (pred_8 ?v8) (pred_2 ?v8 ?v5) (pred_6 ?v5))
:effect (and (pred_8 ?v5) (not (pred_8 ?v8))))

(:action op_3
:parameters (?v8 ?v13)
:precondition (and (pred_3 ?v8) (pred_4 ?v13) 
                  (pred_8 ?v8) (pred_11 ?v13 ?v8) (pred_10 ))
:effect (and (pred_7 ?v13)
   (not (pred_11 ?v13 ?v8)) (not (pred_10 ))))


(:action op_4
:parameters (?v8 ?v10 ?v6)
:precondition (and (pred_3 ?v8) (pred_4 ?v10) (pred_4 ?v6)
                  (pred_8 ?v8) (pred_7 ?v6) (pred_11 ?v10 ?v8))
:effect (and (pred_7 ?v10) (pred_11 ?v6 ?v8)
        (not (pred_7 ?v6)) (not (pred_11 ?v10 ?v8))))

(:action op_2
:parameters (?v8 ?v13)
:precondition (and (pred_3 ?v8) (pred_4 ?v13) 
                  (pred_8 ?v8) (pred_7 ?v13))
:effect (and (pred_10 ) (pred_11 ?v13 ?v8) (not (pred_7 ?v13)))))

; problem
(define (problem grid-4-4-2-3-3)
    (:domain grid)
    (:objects
    obj_13 obj_12 obj_18 obj_01 obj_21 obj_16 obj_17 obj_02 obj_08 obj_10 obj_15 obj_04 obj_09 obj_19 obj_06 obj_11
    obj_14 obj_05
    obj_03 obj_07 obj_20
    )

    (:init
       (pred_10)

       (pred_3 obj_13)
       (pred_3 obj_12)
       (pred_3 obj_18)
       (pred_3 obj_01)
       (pred_3 obj_21)
       (pred_3 obj_16)
       (pred_3 obj_17)
       (pred_3 obj_02)
       (pred_3 obj_08)
       (pred_3 obj_10)
       (pred_3 obj_15)
       (pred_3 obj_04)
       (pred_3 obj_09)
       (pred_3 obj_19)
       (pred_3 obj_06)
       (pred_3 obj_11)
       (pred_12 obj_14)
       (pred_12 obj_05)
       (pred_4 obj_03)
       (pred_4 obj_07)
       (pred_4 obj_20)

       (pred_2 obj_13 obj_21)
       (pred_2 obj_13 obj_12)
       (pred_2 obj_12 obj_16)
       (pred_2 obj_12 obj_18)
       (pred_2 obj_12 obj_13)
       (pred_2 obj_18 obj_17)
       (pred_2 obj_18 obj_01)
       (pred_2 obj_18 obj_12)
       (pred_2 obj_01 obj_02)
       (pred_2 obj_01 obj_18)
       (pred_2 obj_21 obj_08)
       (pred_2 obj_21 obj_16)
       (pred_2 obj_21 obj_13)
       (pred_2 obj_16 obj_10)
       (pred_2 obj_16 obj_17)
       (pred_2 obj_16 obj_12)
       (pred_2 obj_16 obj_21)
       (pred_2 obj_17 obj_15)
       (pred_2 obj_17 obj_02)
       (pred_2 obj_17 obj_18)
       (pred_2 obj_17 obj_16)
       (pred_2 obj_02 obj_04)
       (pred_2 obj_02 obj_01)
       (pred_2 obj_02 obj_17)
       (pred_2 obj_08 obj_09)
       (pred_2 obj_08 obj_10)
       (pred_2 obj_08 obj_21)
       (pred_2 obj_10 obj_19)
       (pred_2 obj_10 obj_15)
       (pred_2 obj_10 obj_16)
       (pred_2 obj_10 obj_08)
       (pred_2 obj_15 obj_06)
       (pred_2 obj_15 obj_04)
       (pred_2 obj_15 obj_17)
       (pred_2 obj_15 obj_10)
       (pred_2 obj_04 obj_11)
       (pred_2 obj_04 obj_02)
       (pred_2 obj_04 obj_15)
       (pred_2 obj_09 obj_19)
       (pred_2 obj_09 obj_08)
       (pred_2 obj_19 obj_06)
       (pred_2 obj_19 obj_10)
       (pred_2 obj_19 obj_09)
       (pred_2 obj_06 obj_11)
       (pred_2 obj_06 obj_15)
       (pred_2 obj_06 obj_19)
       (pred_2 obj_11 obj_04)
       (pred_2 obj_11 obj_06)
       (pred_5 obj_16)
       (pred_5 obj_06)
       (pred_5 obj_02)
       (pred_9  obj_16 obj_14)
       (pred_9  obj_06 obj_05)
       (pred_9  obj_02 obj_05)
       (pred_6 obj_13)
       (pred_6 obj_12)
       (pred_6 obj_18)
       (pred_6 obj_01)
       (pred_6 obj_21)
       (pred_6 obj_17)
       (pred_6 obj_08)
       (pred_6 obj_10)
       (pred_6 obj_15)
       (pred_6 obj_04)
       (pred_6 obj_09)
       (pred_6 obj_19)
       (pred_6 obj_11)

       (pred_1  obj_03 obj_14)
       (pred_1  obj_07 obj_05)
       (pred_1  obj_20 obj_05)
       (pred_11 obj_03 obj_18)
       (pred_11 obj_07 obj_10)
       (pred_11 obj_20 obj_01)
       (pred_8 obj_13)
    )

    (:goal (and
       (pred_11 obj_03 obj_21)
    ))
(:constraints
  (always (not (pred_8 obj_12)))
)
)

; plan
1. (op_5 obj_13 obj_21)
   deleted: (pred_8 obj_13)
   added: (pred_8 obj_21)
   goals met: 0 of 1
2. (op_5 obj_21 obj_08)
   deleted: (pred_8 obj_21)
   added: (pred_8 obj_08)
   goals met: 0 of 1
3. (op_5 obj_08 obj_10)
   deleted: (pred_8 obj_08)
   added: (pred_8 obj_10)
   goals met: 0 of 1
4. (op_5 obj_10 obj_15)
   deleted: (pred_8 obj_10)
   added: (pred_8 obj_15)
   goals met: 0 of 1
5. (op_5 obj_15 obj_17)
   deleted: (pred_8 obj_15)
   added: (pred_8 obj_17)
   goals met: 0 of 1
6. (op_5 obj_17 obj_18)
   deleted: (pred_8 obj_17)
   added: (pred_8 obj_18)
   goals met: 0 of 1
7. (op_3 obj_18 obj_03)
   deleted: (pred_11 obj_03 obj_18) (pred_10)
   added: (pred_7 obj_03)
   goals met: 0 of 1
8. (op_5 obj_18 obj_17)
   deleted: (pred_8 obj_18)
   added: (pred_8 obj_17)
   goals met: 0 of 1
9. (op_1 obj_17 obj_16 obj_03 obj_14)
   deleted: (pred_5 obj_16)
   added: (pred_6 obj_16)
   goals met: 0 of 1
10. (op_5 obj_17 obj_16)
   deleted: (pred_8 obj_17)
   added: (pred_8 obj_16)
   goals met: 0 of 1
11. (op_5 obj_16 obj_21)
   deleted: (pred_8 obj_16)
   added: (pred_8 obj_21)
   goals met: 0 of 1
12. (op_2 obj_21 obj_03)
   deleted: (pred_7 obj_03)
   added: (pred_10) (pred_11 obj_03 obj_21)
   goals met: 1 of 1
